In [2]:
import pandas as pd
from sqlalchemy import create_engine

In [3]:
engine = create_engine('mssql+pyodbc://scott:tiger@mydsn')

In [7]:
df = pd.read_csv('C:\\Users\\user\\Desktop\\py-master\\pandas\\21_sql\\customers.csv')
df

     Customer Name  Customer Phone
0     rafael nadal      4567895647
1  maria sharapova       434534545
2   vladimir putin        89345345
3      kim un jong       123434456
4       jeff bezos       934534543
5     rahul gandhi        44324222